request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:ws="http://api.vetrf.ru/schema/cdm/registry/ws-definitions/v2"
                  xmlns:bs="http://api.vetrf.ru/schema/cdm/base"
                  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                  xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ ">
    <soapenv:Header/>
    <soapenv:Body>
        <ws:getResearchMethodListRequest>
            <bs:listOptions>
                <bs:count>1000</bs:count>
                <bs:offset>0</bs:offset>
            </bs:listOptions>
        </ws:getResearchMethodListRequest>
    </soapenv:Body>
</soapenv:Envelope>


<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ws="http://api.vetrf.ru/schema/cdm/registry/ws-definitions/v2" xmlns:bs="http://api.vetrf.ru/schema/cdm/base" xmlns:dt="http://api.vetrf.ru/schema/cdm/dictionary/v2">
   <soapenv:Header/>
   <soapenv:Body>
      <ws:getSubProductByProductListRequest>
          <bs:listOptions>
            <bs:count>3</bs:count>
            <bs:offset>0</bs:offset>
         </bs:listOptions>
         <dt:productGuid>337f79dc-4376-6e33-dabe-d5447913b97d</dt:productGuid>
      </ws:getSubProductByProductListRequest>
   </soapenv:Body>
</soapenv:Envelope>
